RubenKelevra/espressif_esp32-camera/driver/cam_hal.c
typedef struct {
    size_t len;
    bool eof;
} cam_dma_frame_len_t;

static cam_dma_frame_len_t cam_dma_received_size(const lldesc_t *dma, uint32_t count)
{
    cam_dma_frame_len_t result = { 0, false };

    for (uint32_t i = 0; i < count; i++) {
        result.len += dma[i].length;
        if (dma[i].eof) {
            result.eof = true;
            break;
        }
    }

    return result;
}

static bool cam_queue_frame(camera_fb_t *frame_buffer_event, int frame_pos)
{
    cam_obj->frames[frame_pos].en = 0;

    if (xQueueSend(cam_obj->frame_buffer_queue, (void *)&frame_buffer_event, 0) == pdTRUE) {
        return true;
    }

    camera_fb_t *old_frame = NULL;
    if (xQueueReceive(cam_obj->frame_buffer_queue, &old_frame, 0) != pdTRUE) {
        cam_obj->frames[frame_pos].en = 1;
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FBQ-RCV\r\n"));
        return false;
    }

    if (xQueueSend(cam_obj->frame_buffer_queue, (void *)&frame_buffer_event, 0) != pdTRUE) {
        cam_obj->frames[frame_pos].en = 1;
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FBQ-SND\r\n"));
        cam_give(old_frame);
        return false;
    }

    cam_give(old_frame);
    return true;
}

static bool cam_verify_dma_jpeg_start(camera_fb_t *frame_buffer_event)
{
    size_t probe_len = cam_obj->dma_half_buffer_size;
    if (probe_len > CAM_SOI_PROBE_BYTES) {
        probe_len = CAM_SOI_PROBE_BYTES;
    }

    cam_drop_psram_cache(frame_buffer_event->buf, probe_len);

    uint8_t soi_probe[CAM_SOI_PROBE_BYTES];
    memcpy(soi_probe, frame_buffer_event->buf, probe_len);

    int soi_off = cam_verify_jpeg_soi(soi_probe, probe_len);
    if (soi_off == 0) {
        return true;
    }

    static uint16_t warn_dma_soi_cnt = 0;
    CAM_WARN_THROTTLE(warn_dma_soi_cnt,
                      soi_off > 0 ? "NO-SOI - JPEG start marker not at pos 0 (DMA)"
                                  : "NO-SOI - JPEG start marker missing (DMA)");
    return false;
}

static bool cam_finish_dma_jpeg_frame(int frame_pos)
{
    camera_fb_t *frame = &cam_obj->frames[frame_pos].fb;
    cam_dma_frame_len_t dma_len = cam_dma_received_size(cam_obj->frames[frame_pos].dma,
                                                        cam_obj->dma_node_cnt);

    ll_cam_stop(cam_obj);

    if (!dma_len.eof) {
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: DMA frame missing EOF descriptor\r\n"));
        cam_obj->frames[frame_pos].en = 1;
        return false;
    }

    if (dma_len.len == 0 || dma_len.len > cam_obj->fb_size) {
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: DMA frame length invalid: %u\r\n"),
                              (unsigned)dma_len.len);
        cam_obj->frames[frame_pos].en = 1;
        return false;
    }

    frame->len = dma_len.len;
    cam_drop_psram_cache(frame->buf, frame->len);

    if (!cam_verify_dma_jpeg_start(frame)) {
        cam_obj->frames[frame_pos].en = 1;
        return false;
    }

    return cam_queue_frame(frame, frame_pos);
}

static void cam_abort_dma_frame(int frame_pos, const char *reason)
{
    ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: %s\r\n"), reason);
    ll_cam_stop(cam_obj);
    cam_obj->frames[frame_pos].en = 1;
}

static void cam_start_next_or_idle(int *frame_pos)
{
    if (cam_start_frame(frame_pos)) {
        cam_obj->frames[*frame_pos].fb.len = 0;
        cam_obj->state = CAM_STATE_READ_BUF;
    } else {
        cam_obj->state = CAM_STATE_IDLE;
    }
}

static void cam_task_handle_dma_jpeg_event(cam_event_t cam_event, int *frame_pos)
{
    static uint32_t dma_jpeg_vsync_events = 0;
    static uint32_t dma_jpeg_eof_events = 0;
    static uint32_t dma_jpeg_error_events = 0;

    if (cam_event == CAM_DMA_ERROR_EVENT) {
        dma_jpeg_error_events++;
        ESP_LOGW(TAG, "JPEG DMA event: descriptor error, frame=%d, err=%lu, vsync=%lu, eof=%lu",
                 *frame_pos, dma_jpeg_error_events, dma_jpeg_vsync_events, dma_jpeg_eof_events);
        cam_abort_dma_frame(*frame_pos, "DMA descriptor error");
        cam_obj->state = CAM_STATE_IDLE;
        return;
    }

    if (cam_event == CAM_VSYNC_EVENT) {
        dma_jpeg_vsync_events++;
        if (dma_jpeg_vsync_events <= 8 || (dma_jpeg_vsync_events & 0x3f) == 0) {
            ESP_LOGW(TAG, "JPEG DMA event: VSYNC while waiting EOF, frame=%d, vsync=%lu, eof=%lu, err=%lu",
                     *frame_pos, dma_jpeg_vsync_events, dma_jpeg_eof_events, dma_jpeg_error_events);
        }
        /* In VSYNC-EOF mode this boundary is expected to generate the GDMA EOF
         * event.  The frame is completed only after descriptor EOF writeback is
         * observed in CAM_IN_SUC_EOF_EVENT. */
        return;
    }

    if (cam_event != CAM_IN_SUC_EOF_EVENT) {
        return;
    }

    dma_jpeg_eof_events++;
    ESP_LOGW(TAG, "JPEG DMA event: EOF, frame=%d, vsync=%lu, eof=%lu, err=%lu",
             *frame_pos, dma_jpeg_vsync_events, dma_jpeg_eof_events, dma_jpeg_error_events);
    (void)cam_finish_dma_jpeg_frame(*frame_pos);
    cam_start_next_or_idle(frame_pos);
}

static void cam_task_handle_dma_raw_event(cam_event_t cam_event, int *frame_pos, int *cnt)
{
    camera_fb_t *frame = &cam_obj->frames[*frame_pos].fb;

    if (cam_event == CAM_IN_SUC_EOF_EVENT) {
        if ((uint32_t)(*cnt + 1) >= cam_obj->frame_copy_cnt) {
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: DMA overflow\r\n"));
            ll_cam_stop(cam_obj);
            cam_obj->frames[*frame_pos].en = 1;
            cam_obj->state = CAM_STATE_IDLE;
            *cnt = 0;
            return;
        }
        (*cnt)++;
        return;
    }

    if (cam_event == CAM_DMA_ERROR_EVENT) {
        cam_abort_dma_frame(*frame_pos, "DMA descriptor error");
        cam_obj->state = CAM_STATE_IDLE;
        *cnt = 0;
        return;
    }

    if (cam_event != CAM_VSYNC_EVENT) {
        return;
    }

    ll_cam_stop(cam_obj);
    frame->len = cam_obj->recv_size;

    (void)cam_queue_frame(frame, *frame_pos);

    cam_start_next_or_idle(frame_pos);
    *cnt = 0;
}

static void cam_task_handle_bounce_eof(camera_fb_t *frame, int *cnt)
{
    size_t pixels_per_dma = (cam_obj->dma_half_buffer_size * cam_obj->fb_bytes_per_pixel) /
                            (cam_obj->dma_bytes_per_item * cam_obj->in_bytes_per_pixel);

    if (cam_obj->fb_size < (frame->len + pixels_per_dma)) {
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FB-OVF\r\n"));
        ll_cam_stop(cam_obj);
        return;
    }

