RubenKelevra/espressif_esp32-camera/driver/cam_hal.c
    frame->len += ll_cam_memcpy(cam_obj,
                                &frame->buf[frame->len],
                                &cam_obj->dma_buffer[(*cnt % cam_obj->dma_half_buffer_cnt) * cam_obj->dma_half_buffer_size],
                                cam_obj->dma_half_buffer_size);

    if (cam_obj->jpeg_mode && *cnt == 0) {
        int soi_off = cam_verify_jpeg_soi(frame->buf, frame->len);
        if (soi_off != 0) {
            static uint16_t warn_soi_bad_cnt = 0;
            CAM_WARN_THROTTLE(warn_soi_bad_cnt,
                              soi_off > 0 ? "NO-SOI - JPEG start marker not at pos 0"
                                          : "NO-SOI - JPEG start marker missing");
            ll_cam_stop(cam_obj);
            return;
        }
    }

    (*cnt)++;
}

static void cam_task_handle_bounce_vsync(camera_fb_t *frame, int *frame_pos, int *cnt)
{
    size_t pixels_per_dma = (cam_obj->dma_half_buffer_size * cam_obj->fb_bytes_per_pixel) /
                            (cam_obj->dma_bytes_per_item * cam_obj->in_bytes_per_pixel);

    ll_cam_stop(cam_obj);

    if (*cnt || !cam_obj->jpeg_mode) {
        if (cam_obj->jpeg_mode) {
            if (cam_obj->fb_size < (frame->len + pixels_per_dma)) {
                ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FB-OVF\r\n"));
            } else {
                frame->len += ll_cam_memcpy(cam_obj,
                                            &frame->buf[frame->len],
                                            &cam_obj->dma_buffer[(*cnt % cam_obj->dma_half_buffer_cnt) * cam_obj->dma_half_buffer_size],
                                            cam_obj->dma_half_buffer_size);
            }
        } else if (frame->len != cam_obj->fb_size) {
            cam_obj->frames[*frame_pos].en = 1;
            ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: FB-SIZE: %u != %u\r\n"),
                                  frame->len, (unsigned)cam_obj->fb_size);
        }

        if (!cam_obj->frames[*frame_pos].en) {
            (void)cam_queue_frame(frame, *frame_pos);
        }
    }

    cam_start_next_or_idle(frame_pos);
    *cnt = 0;
}

/* Camera task event model:
 *
 * - Bounce mode keeps the historical 1024-byte EOF stream.  EOF copies one
 *   chunk from internal DMA memory, and VSYNC publishes the completed frame.
 *
 * - Raw DMA mode still uses 1024-byte EOF progress events and VSYNC publishes
 *   a recv_size frame.  Pixel-format conversion, when needed, is performed by
 *   cam_take() after cache synchronization.
 *
 * - JPEG DMA mode uses LCD_CAM CAM_VS_EOF_EN.  VSYNC causes one GDMA EOF for
 *   the whole frame.  The task publishes only from the GDMA EOF event, after
 *   descriptor length/eof writeback is visible.  Descriptor-empty/error is the
 *   overrun guard; there is no circular-descriptor overshoot area in this mode.
 */
static void cam_task(void *arg)
{
    int cnt = 0;
    int frame_pos = 0;
    cam_event_t cam_event = 0;

    cam_obj->state = CAM_STATE_IDLE;
    xQueueReset(cam_obj->event_queue);

    while (1) {
        xQueueReceive(cam_obj->event_queue, (void *)&cam_event, portMAX_DELAY);
        DBG_PIN_SET(1);

        switch (cam_obj->state) {
        case CAM_STATE_IDLE:
            if (cam_event == CAM_VSYNC_EVENT) {
                cam_start_next_or_idle(&frame_pos);
                cnt = 0;
            }
            break;

        case CAM_STATE_READ_BUF: {
            camera_fb_t *frame = &cam_obj->frames[frame_pos].fb;

            if (cam_obj->dma_mode && cam_obj->jpeg_mode) {
                cam_task_handle_dma_jpeg_event(cam_event, &frame_pos);
                cnt = 0;
                break;
            }

            if (cam_obj->dma_mode) {
                cam_task_handle_dma_raw_event(cam_event, &frame_pos, &cnt);
                break;
            }

            if (cam_event == CAM_IN_SUC_EOF_EVENT) {
                cam_task_handle_bounce_eof(frame, &cnt);
            } else if (cam_event == CAM_VSYNC_EVENT) {
                cam_task_handle_bounce_vsync(frame, &frame_pos, &cnt);
            } else if (cam_event == CAM_DMA_ERROR_EVENT) {
                ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: unexpected DMA error in bounce mode\r\n"));
                ll_cam_stop(cam_obj);
                cam_obj->state = CAM_STATE_IDLE;
            }
            break;
        }
        }

        DBG_PIN_SET(0);
    }
}


static lldesc_t * allocate_dma_descriptors(uint32_t count, uint16_t size, uint8_t * buffer, bool circular)
{
    lldesc_t *dma = (lldesc_t *)heap_caps_malloc(count * sizeof(lldesc_t), MALLOC_CAP_DMA);
    if (dma == NULL) {
        return dma;
    }

    for (int x = 0; x < count; x++) {
        dma[x].size = size;
        dma[x].length = 0;
        dma[x].sosf = 0;
        dma[x].eof = 0;
        dma[x].owner = 1;
        dma[x].buf = (buffer + size * x);
        dma[x].empty = circular || (x + 1 < count) ? (uint32_t)&dma[(x + 1) % count] : 0;
    }
    return dma;
}

static esp_err_t cam_dma_config(const camera_config_t *config)
{
    bool ret = ll_cam_dma_sizes(cam_obj);
    if (0 == ret) {
        return ESP_FAIL;
    }

    cam_obj->dma_node_cnt = (cam_obj->dma_buffer_size) / cam_obj->dma_node_buffer_size; // Number of DMA nodes
    cam_obj->frame_copy_cnt = cam_obj->recv_size / cam_obj->dma_half_buffer_size; // Number of interrupted copies, ping-pong copy
    if (cam_obj->dma_mode && !cam_obj->jpeg_mode) {
        cam_obj->frame_copy_cnt++;
    }

    ESP_LOGI(TAG, "buffer_size: %d, half_buffer_size: %d, node_buffer_size: %d, node_cnt: %d, total_cnt: %d",
             (int) cam_obj->dma_buffer_size, (int) cam_obj->dma_half_buffer_size, (int) cam_obj->dma_node_buffer_size,
             (int) cam_obj->dma_node_cnt, (int) cam_obj->frame_copy_cnt);

    cam_obj->dma_buffer = NULL;
    cam_obj->dma = NULL;

    cam_obj->frames = (cam_frame_t *)heap_caps_aligned_calloc(alignof(cam_frame_t), 1, cam_obj->frame_cnt * sizeof(cam_frame_t), MALLOC_CAP_DEFAULT);
    CAM_CHECK(cam_obj->frames != NULL, "frames malloc failed", ESP_FAIL);

    uint8_t dma_align = 0;
    size_t fb_size = cam_obj->fb_size;
    if (cam_obj->dma_mode) {
        dma_align = ll_cam_get_dma_align(cam_obj);
        if (fb_size < cam_obj->dma_buffer_size) {
            fb_size = cam_obj->dma_buffer_size;
        }
    }

    /* Allocate memory for frame buffer */
    size_t alloc_size = fb_size * sizeof(uint8_t) + dma_align;
    uint32_t _caps = MALLOC_CAP_8BIT;
    if (CAMERA_FB_IN_DRAM == config->fb_location) {
        _caps |= MALLOC_CAP_INTERNAL;
    } else {
        _caps |= MALLOC_CAP_SPIRAM;
    }
    for (int x = 0; x < cam_obj->frame_cnt; x++) {
        cam_obj->frames[x].dma = NULL;
        cam_obj->frames[x].fb_offset = 0;
        cam_obj->frames[x].en = 0;
        ESP_LOGI(TAG, "Allocating %d Byte frame buffer in %s", alloc_size, _caps & MALLOC_CAP_SPIRAM ? "PSRAM" : "OnBoard RAM");
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 3, 0)
        // In IDF v4.2 and earlier, memory returned by heap_caps_aligned_alloc must be freed using heap_caps_aligned_free.
        // And heap_caps_aligned_free is deprecated on v4.3.
        cam_obj->frames[x].fb.buf = (uint8_t *)heap_caps_aligned_alloc(16, alloc_size, _caps);
#else
        cam_obj->frames[x].fb.buf = (uint8_t *)heap_caps_malloc(alloc_size, _caps);
#endif
        CAM_CHECK(cam_obj->frames[x].fb.buf != NULL, "frame buffer malloc failed", ESP_FAIL);
        if (cam_obj->dma_mode) {
            //align PSRAM buffer. TODO: save the offset so proper address can be freed later
            cam_obj->frames[x].fb_offset = dma_align - ((uint32_t)cam_obj->frames[x].fb.buf & (dma_align - 1));
            cam_obj->frames[x].fb.buf += cam_obj->frames[x].fb_offset;
            ESP_LOGI(TAG, "Frame[%d]: Offset: %u, Addr: 0x%08X", x, cam_obj->frames[x].fb_offset, (unsigned) cam_obj->frames[x].fb.buf);
            cam_obj->frames[x].dma = allocate_dma_descriptors(cam_obj->dma_node_cnt, cam_obj->dma_node_buffer_size, cam_obj->frames[x].fb.buf, !(cam_obj->jpeg_mode && cam_obj->dma_mode));
            CAM_CHECK(cam_obj->frames[x].dma != NULL, "frame dma malloc failed", ESP_FAIL);
        }
        cam_obj->frames[x].en = 1;
    }

    if (!cam_obj->dma_mode) {
        cam_obj->dma_buffer = (uint8_t *)heap_caps_malloc(cam_obj->dma_buffer_size * sizeof(uint8_t), MALLOC_CAP_DMA);
        if(NULL == cam_obj->dma_buffer) {
            ESP_LOGE(TAG,"%s(%d): DMA buffer %d Byte malloc failed, the current largest free block:%d Byte", __FUNCTION__, __LINE__,
                     (int) cam_obj->dma_buffer_size, (int) heap_caps_get_largest_free_block(MALLOC_CAP_DMA));
            return ESP_FAIL;
        }

        cam_obj->dma = allocate_dma_descriptors(cam_obj->dma_node_cnt, cam_obj->dma_node_buffer_size, cam_obj->dma_buffer, true);
        CAM_CHECK(cam_obj->dma != NULL, "dma malloc failed", ESP_FAIL);
    }

    return ESP_OK;
}

esp_err_t cam_init(const camera_config_t *config)
{
    CAM_CHECK(NULL != config, "config pointer is invalid", ESP_ERR_INVALID_ARG);

    esp_err_t ret = ESP_OK;
    cam_obj = (cam_obj_t *)heap_caps_calloc(1, sizeof(cam_obj_t), MALLOC_CAP_DMA);
    CAM_CHECK(NULL != cam_obj, "lcd_cam object malloc error", ESP_ERR_NO_MEM);

    cam_obj->swap_data = 0;
    cam_obj->vsync_pin = config->pin_vsync;
    cam_obj->vsync_invert = true;

